espressif/esp-matter/connectedhomeip/connectedhomeip/third_party/openthread/ot-efr32/third_party/silabs/gecko_sdk/platform/emlib/inc/em_ldma.h
    uint32_t  linkMode   : 1;   /**< Select absolute or relative link address.       */
    uint32_t  link       : 1;   /**< Enable LINKLOAD when transfer is done.          */
    int32_t   linkAddr   : 30;  /**< Address of next (linked) descriptor.            */
  } sync;

  /** WRITE DMA descriptor, used for write immediate operations.                     */
  struct {
    uint32_t  structType : 2;   /**< Set to 2 to select WRITE descriptor type.       */
    uint32_t  reserved0  : 1;   /**< Reserved.                                       */
    uint32_t  structReq  : 1;   /**< DMA transfer trigger during LINKLOAD.           */
    uint32_t  xferCnt    : 11;  /**< Transfer count minus one.                       */
    uint32_t  byteSwap   : 1;   /**< Enable byte swapping transfers.                 */
    uint32_t  blockSize  : 4;   /**< Number of unit transfers per arbitration cycle. */
    uint32_t  doneIfs    : 1;   /**< Generate interrupt when done.                   */
    uint32_t  reqMode    : 1;   /**< Block or cycle transfer selector.               */
    uint32_t  decLoopCnt : 1;   /**< Enable looped transfers.                        */
    uint32_t  ignoreSrec : 1;   /**< Ignore single requests.                         */
    uint32_t  srcInc     : 2;   /**< Source address increment unit size.             */
    uint32_t  size       : 2;   /**< DMA transfer unit size.                         */
    uint32_t  dstInc     : 2;   /**< Destination address increment unit size.        */
    uint32_t  srcAddrMode : 1;  /**< Source addressing mode.                         */
    uint32_t  dstAddrMode : 1;  /**< Destination addressing mode.                    */

    uint32_t  immVal;           /**< Data to be written at dstAddr.                  */
    uint32_t  dstAddr;          /**< DMA write destination address.                  */

    uint32_t  linkMode   : 1;   /**< Select absolute or relative link address.       */
    uint32_t  link       : 1;   /**< Enable LINKLOAD when transfer is done.          */
    int32_t   linkAddr   : 30;  /**< Address of next (linked) descriptor.            */
  } wri;
} LDMA_Descriptor_t;

#if defined(_LDMA_CH_CTRL_EXTEND_MASK)
/**
 * @brief
 *   DMA extended descriptor.
 * @details
 *   The extended descriptor adds additional fields for the extended features
 *   available on the MMLDMA peripheral: destination interleaving and bufferable.
 *   The same three different DMA descriptors supported by the LDMA DMA controller
 *   are available. Each consists of seven WORDs (instead of four in non-extended
 *   descriptors) which map directly onto HW control registers for a given DMA
 *   channel. The three descriptor types are XFER, SYNC and WRI. But the
 *   extended fields are true only for XFER. The extended fields are the following:
 *
 *             +-          +- CTRL
 *             | Original  |  SRC
 *             | Structure |  DST
 *   Extended  |           +- LINK
 *   Structure |              XCTRL
 *             |              Reserved for future usage
 *             +-             ILSRC
 *
 *   Refer to the reference manual for further information.
 */
typedef struct {
  uint32_t  structType : 2;     /**< Set to 0 to select XFER descriptor type.        */
  uint32_t  extend     : 1;     /**< Extend data structure.                          */
  uint32_t  structReq  : 1;     /**< DMA transfer trigger during LINKLOAD.           */
  uint32_t  xferCnt    : 11;    /**< Transfer count minus one.                       */
  uint32_t  byteSwap   : 1;     /**< Enable byte swapping transfers.                 */
  uint32_t  blockSize  : 4;     /**< Number of unit transfers per arbitration cycle. */
  uint32_t  doneIfs    : 1;     /**< Generate interrupt when done.                   */
  uint32_t  reqMode    : 1;     /**< Block or cycle transfer selector.               */
  uint32_t  decLoopCnt : 1;     /**< Enable looped transfers.                        */
  uint32_t  ignoreSrec : 1;     /**< Ignore single requests.                         */
  uint32_t  srcInc     : 2;     /**< Source address increment unit size.             */
  uint32_t  size       : 2;     /**< DMA transfer unit size.                         */
  uint32_t  dstInc     : 2;     /**< Destination address increment unit size.        */
  uint32_t  srcAddrMode : 1;    /**< Source addressing mode.                         */
  uint32_t  dstAddrMode : 1;    /**< Destination addressing mode.                    */

  uint32_t  srcAddr;            /**< DMA source address.                             */
  uint32_t  dstAddr;            /**< DMA destination address.                        */

  uint32_t  linkMode   : 1;     /**< Select absolute or relative link address.       */
  uint32_t  link       : 1;     /**< Enable LINKLOAD when transfer is done.          */
  int32_t   linkAddr   : 30;    /**< Address of next (linked) descriptor.            */

  uint32_t  reserved1  : 4;     /**< Reserved                                        */
  uint32_t  dstIlEn    : 1;     /**< Destination interleave.                         */
  uint32_t  IlMode     : 2;     /**< Interleave mode.                                */
  uint32_t  bufferable : 1;    /**< Reserved                                        */
  uint32_t  reserved2  : 24;    /**< Allow AHB buffering.                            */

  uint32_t  reserved3;          /**< Reserved                                        */
  uint32_t  IlSrc;              /**< DMA rules table base address in memory.         */
} LDMA_DescriptorExtend_t;
#endif

/** @brief LDMA initialization configuration structure. */
typedef struct {
  uint8_t               ldmaInitCtrlNumFixed;     /**< Arbitration mode separator. */
  uint8_t               ldmaInitCtrlSyncPrsClrEn; /**< PRS Synctrig clear enable.  */
  uint8_t               ldmaInitCtrlSyncPrsSetEn; /**< PRS Synctrig set enable.    */
  uint8_t               ldmaInitIrqPriority;      /**< LDMA IRQ priority (0..7).   */
} LDMA_Init_t;

/**
 * @brief
 *   DMA transfer configuration structure.
 * @details
 *   This structure configures all aspects of a DMA transfer.
 */
typedef struct {
  uint32_t                ldmaReqSel;            /**< Selects DMA trigger source.                  */
  uint8_t                 ldmaCtrlSyncPrsClrOff; /**< PRS Synctrig clear enables to clear.         */
  uint8_t                 ldmaCtrlSyncPrsClrOn;  /**< PRS Synctrig clear enables to set.           */
  uint8_t                 ldmaCtrlSyncPrsSetOff; /**< PRS Synctrig set enables to clear.           */
  uint8_t                 ldmaCtrlSyncPrsSetOn;  /**< PRS Synctrig set enables to set.             */
  bool                    ldmaReqDis;            /**< Mask the PRS trigger input.                  */
  bool                    ldmaDbgHalt;           /**< Dis. DMA trig when CPU is halted.            */
  LDMA_CfgArbSlots_t      ldmaCfgArbSlots;       /**< Arbitration slot number.                     */
  LDMA_CfgSrcIncSign_t    ldmaCfgSrcIncSign;     /**< Source address increment sign.               */
  LDMA_CfgDstIncSign_t    ldmaCfgDstIncSign;     /**< Destination address increment sign.          */
  uint8_t                 ldmaLoopCnt;           /**< Counter for looped transfers.                */
#if defined(_LDMA_CH_CFG_SRCBUSPORT_MASK)
  LDMA_CfgStructBusPort_t ldmaCfgStructBusPort;  /**< Structure fetch operation bus port.          */
  LDMA_CfgSrcBusPort_t    ldmaCfgSrcBusPort;     /**< Source operation bus port.                   */
  LDMA_CfgDstBusPort_t    ldmaCfgDstBusPort;     /**< Destination operation bus port.              */
#endif
} LDMA_TransferCfg_t;

