espressif/esp-matter/connectedhomeip/connectedhomeip/third_party/openthread/ot-efr32/third_party/silabs/gecko_sdk/platform/emlib/inc/em_ldma.h
#if defined(_LDMA_CH_CTRL_EXTEND_MASK)
/**
 * @brief
 *   DMA descriptor initializer for linked memory to memory byte transfer
 *   using the extended descriptor fields.
 *
 *   Link address is a relative address.
 * @note
 *   The linkAddr member of the transfer descriptor is initialized to 4
 *   (regular descriptor) or 7 (extended descriptor),  assuming that
 *   the next descriptor immediately follows this descriptor (in memory).
 * @param[in] src       Source data address.
 * @param[in] dest      Destination data address.
 * @param[in] count     Number of bytes to transfer.
 * @param[in] linkjmp   Address of descriptor to link to, expressed as a
 *                      signed number of descriptors from "here".
 *                      1=one descriptor forward in memory,
 *                      0=this descriptor,
 *                      -1=one descriptor back in memory.
 */
#define LDMA_DESCRIPTOR_LINKREL_M2M_BYTE_EXTEND(src, dest, count, linkjmp) \
  {                                                                        \
    .structType   = ldmaCtrlStructTypeXfer,                                \
    .extend       = 1,                                                     \
    .structReq    = 1,                                                     \
    .xferCnt      = (count) - 1,                                           \
    .byteSwap     = 0,                                                     \
    .blockSize    = ldmaCtrlBlockSizeUnit1,                                \
    .doneIfs      = 0,                                                     \
    .reqMode      = ldmaCtrlReqModeAll,                                    \
    .decLoopCnt   = 0,                                                     \
    .ignoreSrec   = 0,                                                     \
    .srcInc       = ldmaCtrlSrcIncOne,                                     \
    .size         = ldmaCtrlSizeByte,                                      \
    .dstInc       = ldmaCtrlDstIncNone,                                    \
    .srcAddrMode  = ldmaCtrlSrcAddrModeAbs,                                \
    .dstAddrMode  = ldmaCtrlDstAddrModeAbs,                                \
    .srcAddr      = (uint32_t)(src),                                       \
    .dstAddr      = (uint32_t)(dest),                                      \
    .linkMode     = ldmaLinkModeRel,                                       \
    .link         = 1,                                                     \
    .linkAddr     = (linkjmp) * LDMA_DESCRIPTOR_EXTEND_SIZE_WORD,          \
    .dstIlEn      = 0,                                                     \
    .IlMode       = 0,                                                     \
    .bufferable   = 0,                                                     \
    .IlSrc        = 0                                                      \
  }
#endif

/**
 * @brief
 *   DMA descriptor initializer for byte transfers from a peripheral to memory.
 * @param[in] src       Peripheral data source register address.
 * @param[in] dest      Destination data address.
 * @param[in] count     Number of bytes to transfer.
 */
#define LDMA_DESCRIPTOR_SINGLE_P2M_BYTE(src, dest, count) \
  {                                                       \
    .xfer =                                               \
    {                                                     \
      .structType   = ldmaCtrlStructTypeXfer,             \
      .structReq    = 0,                                  \
      .xferCnt      = (count) - 1,                        \
      .byteSwap     = 0,                                  \
      .blockSize    = ldmaCtrlBlockSizeUnit1,             \
      .doneIfs      = 1,                                  \
      .reqMode      = ldmaCtrlReqModeBlock,               \
      .decLoopCnt   = 0,                                  \
      .ignoreSrec   = 0,                                  \
      .srcInc       = ldmaCtrlSrcIncNone,                 \
      .size         = ldmaCtrlSizeByte,                   \
      .dstInc       = ldmaCtrlDstIncOne,                  \
      .srcAddrMode  = ldmaCtrlSrcAddrModeAbs,             \
      .dstAddrMode  = ldmaCtrlDstAddrModeAbs,             \
      .srcAddr      = (uint32_t)(src),                    \
      .dstAddr      = (uint32_t)(dest),                   \
      .linkMode     = 0,                                  \
      .link         = 0,                                  \
      .linkAddr     = 0                                   \
    }                                                     \
  }

#if defined(_LDMA_CH_CTRL_EXTEND_MASK)
/**
 * @brief
 *   DMA descriptor initializer for byte transfers from a peripheral to memory
 *   using the extended descriptor fields.
 * @param[in] src       Peripheral data source register address.
 * @param[in] dest      Destination data address.
 * @param[in] count     Number of bytes to transfer.
 */
#define LDMA_DESCRIPTOR_SINGLE_P2M_BYTE_EXTEND(src, dest, count) \
  {                                                              \
    .structType   = ldmaCtrlStructTypeXfer,                      \
    .extend       = 1,                                           \
    .structReq    = 0,                                           \
    .xferCnt      = (count) - 1,                                 \
    .byteSwap     = 0,                                           \
    .blockSize    = ldmaCtrlBlockSizeUnit1,                      \
    .doneIfs      = 1,                                           \
    .reqMode      = ldmaCtrlReqModeBlock,                        \
    .decLoopCnt   = 0,                                           \
    .ignoreSrec   = 0,                                           \
    .srcInc       = ldmaCtrlSrcIncNone,                          \
    .size         = ldmaCtrlSizeByte,                            \
    .dstInc       = ldmaCtrlDstIncNone,                          \
    .srcAddrMode  = ldmaCtrlSrcAddrModeAbs,                      \
    .dstAddrMode  = ldmaCtrlDstAddrModeAbs,                      \
    .srcAddr      = (uint32_t)(src),                             \
    .dstAddr      = (uint32_t)(dest),                            \
    .linkMode     = 0,                                           \
    .link         = 0,                                           \
    .linkAddr     = 0,                                           \
    .dstIlEn      = 0,                                           \
    .IlMode       = 0,                                           \
    .bufferable   = 0,                                           \
    .IlSrc        = 0                                            \
  }
#endif

/**
 * @brief
 *   DMA descriptor initializer for byte transfers from a peripheral to a peripheral.
 * @param[in] src       Peripheral data source register address.
 * @param[in] dest      Peripheral data destination register address.
 * @param[in] count     Number of bytes to transfer.
 */
#define LDMA_DESCRIPTOR_SINGLE_P2P_BYTE(src, dest, count) \
  {                                                       \
    .xfer =                                               \
    {                                                     \
      .structType   = ldmaCtrlStructTypeXfer,             \
      .structReq    = 0,                                  \
      .xferCnt      = (count) - 1,                        \
      .byteSwap     = 0,                                  \
      .blockSize    = ldmaCtrlBlockSizeUnit1,             \
      .doneIfs      = 1,                                  \
      .reqMode      = ldmaCtrlReqModeBlock,               \
      .decLoopCnt   = 0,                                  \
      .ignoreSrec   = 0,                                  \
      .srcInc       = ldmaCtrlSrcIncNone,                 \
      .size         = ldmaCtrlSizeByte,                   \
      .dstInc       = ldmaCtrlDstIncNone,                 \
      .srcAddrMode  = ldmaCtrlSrcAddrModeAbs,             \
      .dstAddrMode  = ldmaCtrlDstAddrModeAbs,             \
      .srcAddr      = (uint32_t)(src),                    \
      .dstAddr      = (uint32_t)(dest),                   \
      .linkMode     = 0,                                  \
      .link         = 0,                                  \
      .linkAddr     = 0                                   \
    }                                                     \
  }

/**
 * @brief
 *   DMA descriptor initializer for byte transfers from memory to a peripheral.
 * @param[in] src       Source data address.
 * @param[in] dest      Peripheral data register destination address.
 * @param[in] count     Number of bytes to transfer.
 */
#define LDMA_DESCRIPTOR_SINGLE_M2P_BYTE(src, dest, count) \
  {                                                       \
    .xfer =                                               \
    {                                                     \
      .structType   = ldmaCtrlStructTypeXfer,             \
      .structReq    = 0,                                  \
      .xferCnt      = (count) - 1,                        \
      .byteSwap     = 0,                                  \
      .blockSize    = ldmaCtrlBlockSizeUnit1,             \
      .doneIfs      = 1,                                  \
      .reqMode      = ldmaCtrlReqModeBlock,               \
      .decLoopCnt   = 0,                                  \
      .ignoreSrec   = 0,                                  \
      .srcInc       = ldmaCtrlSrcIncOne,                  \
      .size         = ldmaCtrlSizeByte,                   \
      .dstInc       = ldmaCtrlDstIncNone,                 \
      .srcAddrMode  = ldmaCtrlSrcAddrModeAbs,             \
      .dstAddrMode  = ldmaCtrlDstAddrModeAbs,             \
      .srcAddr      = (uint32_t)(src),                    \
      .dstAddr      = (uint32_t)(dest),                   \
      .linkMode     = 0,                                  \
      .link         = 0,                                  \
      .linkAddr     = 0                                   \
    }                                                     \
  }

#if defined(_LDMA_CH_CTRL_EXTEND_MASK)
/**
 * @brief
 *   DMA descriptor initializer for byte transfers from memory to a peripheral
 *   using the extended descriptor fields.
 * @note
 *   For the extended descriptor, if IlMode uses the absolute addressing, the
 *   rules are used directly as the destination addresses of the corresponding
 *   data. Thus the argument 'dest' will be ignored by the DMA engine.
 * @param[in] src       Source data address.
 * @param[in] dest      Peripheral data register destination address.
 * @param[in] count     Number of bytes to transfer.
 */
#define LDMA_DESCRIPTOR_SINGLE_M2P_BYTE_EXTEND(src, dest, count) \
  {                                                              \
    .structType   = ldmaCtrlStructTypeXfer,                      \
    .extend       = 1,                                           \
    .structReq    = 0,                                           \
    .xferCnt      = (count) - 1,                                 \
    .byteSwap     = 0,                                           \
    .blockSize    = ldmaCtrlBlockSizeUnit1,                      \
    .doneIfs      = 1,                                           \
    .reqMode      = ldmaCtrlReqModeBlock,                        \
    .decLoopCnt   = 0,                                           \
    .ignoreSrec   = 0,                                           \
    .srcInc       = ldmaCtrlSrcIncOne,                           \
    .size         = ldmaCtrlSizeByte,                            \
    .dstInc       = ldmaCtrlDstIncNone,                          \
    .srcAddrMode  = ldmaCtrlSrcAddrModeAbs,                      \
    .dstAddrMode  = ldmaCtrlDstAddrModeAbs,                      \
    .srcAddr      = (uint32_t)(src),                             \
    .dstAddr      = (uint32_t)(dest),                            \
    .linkMode     = 0,                                           \
    .link         = 0,                                           \
    .linkAddr     = 0,                                           \
    .dstIlEn      = 0,                                           \
    .IlMode       = 0,                                           \
    .bufferable   = 0,                                           \
    .IlSrc        = 0                                            \
  }
#endif

/**
 * @brief
 *   DMA descriptor initializer for byte transfers from a peripheral to memory.
 * @param[in] src       Peripheral data source register address.
 * @param[in] dest      Destination data address.
 * @param[in] count     Number of bytes to transfer.
 * @param[in] linkjmp   Address of descriptor to link to, expressed as a
 *                      signed number of descriptors from "here".
 *                      1=one descriptor forward in memory,
 *                      0=this descriptor,
 *                      -1=one descriptor back in memory.
 */
#define LDMA_DESCRIPTOR_LINKREL_P2M_BYTE(src, dest, count, linkjmp)    \
  {                                                                    \
    .xfer =                                                            \
    {                                                                  \
      .structType   = ldmaCtrlStructTypeXfer,                          \
      .structReq    = 0,                                               \
      .xferCnt      = (count) - 1,                                     \
      .byteSwap     = 0,                                               \
      .blockSize    = ldmaCtrlBlockSizeUnit1,                          \
      .doneIfs      = 1,                                               \
      .reqMode      = ldmaCtrlReqModeBlock,                            \
      .decLoopCnt   = 0,                                               \
      .ignoreSrec   = 0,                                               \
      .srcInc       = ldmaCtrlSrcIncNone,                              \
      .size         = ldmaCtrlSizeByte,                                \
      .dstInc       = ldmaCtrlDstIncOne,                               \
      .srcAddrMode  = ldmaCtrlSrcAddrModeAbs,                          \
      .dstAddrMode  = ldmaCtrlDstAddrModeAbs,                          \
      .srcAddr      = (uint32_t)(src),                                 \
      .dstAddr      = (uint32_t)(dest),                                \
      .linkMode     = ldmaLinkModeRel,                                 \
      .link         = 1,                                               \
      .linkAddr     = (linkjmp) * LDMA_DESCRIPTOR_NON_EXTEND_SIZE_WORD \
    }                                                                  \
  }

#if defined(_LDMA_CH_CTRL_EXTEND_MASK)
/**
 * @brief
 *   DMA descriptor initializer for byte transfers from a peripheral to memory
 *   using the extended descriptor fields.
 * @param[in] src       Peripheral data source register address.
 * @param[in] dest      Destination data address.
 * @param[in] count     Number of bytes to transfer.
 * @param[in] linkjmp   Address of descriptor to link to, expressed as a
 *                      signed number of descriptors from "here".
 *                      1=one descriptor forward in memory,
 *                      0=this descriptor,
 *                      -1=one descriptor back in memory.
 */
#define LDMA_DESCRIPTOR_LINKREL_P2M_BYTE_EXTEND(src, dest, count, linkjmp) \
  {                                                                        \
    .structType   = ldmaCtrlStructTypeXfer,                                \
    .extend       = 1,                                                     \
    .structReq    = 0,                                                     \
    .xferCnt      = (count) - 1,                                           \
    .byteSwap     = 0,                                                     \
    .blockSize    = ldmaCtrlBlockSizeUnit1,                                \
    .doneIfs      = 1,                                                     \
    .reqMode      = ldmaCtrlReqModeBlock,                                  \
    .decLoopCnt   = 0,                                                     \
    .ignoreSrec   = 0,                                                     \
    .srcInc       = ldmaCtrlSrcIncNone,                                    \
    .size         = ldmaCtrlSizeByte,                                      \
    .dstInc       = ldmaCtrlDstIncNone,                                    \
    .srcAddrMode  = ldmaCtrlSrcAddrModeAbs,                                \
    .dstAddrMode  = ldmaCtrlDstAddrModeAbs,                                \
    .srcAddr      = (uint32_t)(src),                                       \
    .dstAddr      = (uint32_t)(dest),                                      \
    .linkMode     = ldmaLinkModeRel,                                       \
    .link         = 1,                                                     \
    .linkAddr     = (linkjmp) * LDMA_DESCRIPTOR_EXTEND_SIZE_WORD,          \
    .dstIlEn      = 0,                                                     \
    .IlMode       = 0,                                                     \
    .bufferable   = 0,                                                     \
    .IlSrc        = 0                                                      \
  }
#endif

/**
 * @brief
 *   DMA descriptor initializer for word transfers from a peripheral to memory.
 * @param[in] src       Peripheral data source register address.
 * @param[in] dest      Destination data address.
 * @param[in] count     Number of words to transfer.
 * @param[in] linkjmp   Address of descriptor to link to, expressed as a
 *                      signed number of descriptors from "here".
 *                      1=one descriptor forward in memory,
 *                      0=this descriptor,
 *                      -1=one descriptor back in memory.
 */
#define LDMA_DESCRIPTOR_LINKREL_P2M_WORD(src, dest, count, linkjmp)    \
  {                                                                    \
    .xfer =                                                            \
    {                                                                  \
      .structType   = ldmaCtrlStructTypeXfer,                          \
      .structReq    = 0,                                               \
      .xferCnt      = (count) - 1,                                     \
      .byteSwap     = 0,                                               \
      .blockSize    = ldmaCtrlBlockSizeUnit1,                          \
      .doneIfs      = 1,                                               \
      .reqMode      = ldmaCtrlReqModeBlock,                            \
      .decLoopCnt   = 0,                                               \
      .ignoreSrec   = 0,                                               \
      .srcInc       = ldmaCtrlSrcIncNone,                              \
      .size         = ldmaCtrlSizeWord,                                \
      .dstInc       = ldmaCtrlDstIncOne,                               \
      .srcAddrMode  = ldmaCtrlSrcAddrModeAbs,                          \
      .dstAddrMode  = ldmaCtrlDstAddrModeAbs,                          \
      .srcAddr      = (uint32_t)(src),                                 \
      .dstAddr      = (uint32_t)(dest),                                \
      .linkMode     = ldmaLinkModeRel,                                 \
      .link         = 1,                                               \
      .linkAddr     = (linkjmp) * LDMA_DESCRIPTOR_NON_EXTEND_SIZE_WORD \
    }                                                                  \
  }

#if defined(_LDMA_CH_CTRL_EXTEND_MASK)
/**
 * @brief
 *   DMA descriptor initializer for word transfers from a peripheral to memory
 *   using the extended descriptor fields.
 * @param[in] src       Peripheral data source register address.
 * @param[in] dest      Destination data address.
 * @param[in] count     Number of words to transfer.
 * @param[in] linkjmp   Address of descriptor to link to, expressed as a
 *                      signed number of descriptors from "here".
 *                      1=one descriptor forward in memory,
 *                      0=this descriptor,
 *                      -1=one descriptor back in memory.
 */
#define LDMA_DESCRIPTOR_LINKREL_P2M_WORD_EXTEND(src, dest, count, linkjmp) \
  {                                                                        \
    .structType   = ldmaCtrlStructTypeXfer,                                \
    .extend       = 1,                                                     \
    .structReq    = 0,                                                     \
    .xferCnt      = (count) - 1,                                           \
    .byteSwap     = 0,                                                     \
    .blockSize    = ldmaCtrlBlockSizeUnit1,                                \
    .doneIfs      = 1,                                                     \
    .reqMode      = ldmaCtrlReqModeBlock,                                  \
    .decLoopCnt   = 0,                                                     \
    .ignoreSrec   = 0,                                                     \
    .srcInc       = ldmaCtrlSrcIncNone,                                    \
    .size         = ldmaCtrlSizeWord,                                      \
    .dstInc       = ldmaCtrlDstIncNone,                                    \
    .srcAddrMode  = ldmaCtrlSrcAddrModeAbs,                                \
    .dstAddrMode  = ldmaCtrlDstAddrModeAbs,                                \
    .srcAddr      = (uint32_t)(src),                                       \
    .dstAddr      = (uint32_t)(dest),                                      \
    .linkMode     = ldmaLinkModeRel,                                       \
    .link         = 1,                                                     \
    .linkAddr     = (linkjmp) * LDMA_DESCRIPTOR_EXTEND_SIZE_WORD,          \
    .dstIlEn      = 0,                                                     \
    .IlMode       = 0,                                                     \
    .bufferable   = 0,                                                     \
    .IlSrc        = 0                                                      \
  }
#endif

